## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ses_receipt_rule.ffis_ingest will be created
+   resource "aws_ses_receipt_rule" "ffis_ingest" {
+       arn           = (known after apply)
+       enabled       = true
+       id            = (known after apply)
+       name          = "grants_ingest-staging-ffis_ingest"
+       recipients    = [
+           "ffis-ingest@staging.grants.usdigitalresponse.org",
        ]
+       rule_set_name = "ffis_ingest-rule-set"
+       scan_enabled  = true
+       tls_policy    = "Require"

+       s3_action {
+           bucket_name       = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+           object_key_prefix = "ses/ffis_ingest/new"
+           position          = 1
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.grants_source_data_bucket.aws_s3_bucket_policy.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action    = "s3:*"
                        Condition = {
                            Bool = {
                                "aws:SecureTransport" = [
                                    "false",
                                ]
                            }
                        }
                        Effect    = "Deny"
                        Principal = "*"
                        Resource  = [
                            "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/*",
                            "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2",
                        ]
                        Sid       = "ForceSSLOnlyAccess"
                    },
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "AWS:SourceArn"     = [
-                                   "arn:aws:ses:us-west-2:357150818708:receipt-rule-set/ffis_ingest-rule-set:receipt-rule/ffis_ingest-staging",
+                                   "arn:aws:ses:us-west-2:357150818708:receipt-rule-set/ffis_ingest-rule-set:receipt-rule/grants_ingest-staging-ffis_ingest",
                                ]
                                # (1 unchanged element hidden)
                            }
                        }
                        # (5 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-25T21:39:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:16/invocations" -> (known after apply)
      ~ s3_key                         = "builds/aae21ae59536c585f1cd14c62f3bb4dd29d8673fa3166067074e684715db2991.zip" -> "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.zip"
      ~ s3_object_version              = "6UVNfYRbVvFsj1eldfWq8Fwa1ey2CqVJ" -> (known after apply)
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:b479fbb6c2de3f3d47b6d73baf52f3c890e37ef5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:2ca436f315cf2a46d24ba4a9bada93a0503fbb9c,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "b479fbb6c2de3f3d47b6d73baf52f3c890e37ef5" -> "2ca436f315cf2a46d24ba4a9bada93a0503fbb9c"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "16" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2a2be522b8c0e31aaa633fabb495edfd-2" -> (known after apply)
      ~ id                     = "builds/aae21ae59536c585f1cd14c62f3bb4dd29d8673fa3166067074e684715db2991.zip" -> (known after apply)
      ~ key                    = "builds/aae21ae59536c585f1cd14c62f3bb4dd29d8673fa3166067074e684715db2991.zip" -> "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/aae21ae59536c585f1cd14c62f3bb4dd29d8673fa3166067074e684715db2991.zip" -> "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.zip"
-       tags                   = {} -> null
      ~ version_id             = "6UVNfYRbVvFsj1eldfWq8Fwa1ey2CqVJ" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "425835043072377765" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aae21ae59536c585f1cd14c62f3bb4dd29d8673fa3166067074e684715db2991.zip" -> "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.zip"
          ~ "timestamp" = "1682458673255345200" -> "1682461250576644800"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7415441045302922131" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/aae21ae59536c585f1cd14c62f3bb4dd29d8673fa3166067074e684715db2991.zip" -> "builds/3c2dae1a370c45b8bff581074b5c1ac521b5ba78a79ba6adc1b3aa21ee1a1610.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-25T21:39:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:15/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4313ab299a0768756c36fa6ee623ec04e977a216e0e46a7053a70537980ef815.zip" -> "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.zip"
      ~ s3_object_version              = "S_gLB.aqqx70mMb0t8HDw4J.qfi18i7z" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:b479fbb6c2de3f3d47b6d73baf52f3c890e37ef5,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:2ca436f315cf2a46d24ba4a9bada93a0503fbb9c,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "b479fbb6c2de3f3d47b6d73baf52f3c890e37ef5" -> "2ca436f315cf2a46d24ba4a9bada93a0503fbb9c"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "15" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "19ce0982f15afb9d03eb4297bdf89122-2" -> (known after apply)
      ~ id                     = "builds/4313ab299a0768756c36fa6ee623ec04e977a216e0e46a7053a70537980ef815.zip" -> (known after apply)
      ~ key                    = "builds/4313ab299a0768756c36fa6ee623ec04e977a216e0e46a7053a70537980ef815.zip" -> "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4313ab299a0768756c36fa6ee623ec04e977a216e0e46a7053a70537980ef815.zip" -> "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.zip"
-       tags                   = {} -> null
      ~ version_id             = "S_gLB.aqqx70mMb0t8HDw4J.qfi18i7z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2951998869677770436" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4313ab299a0768756c36fa6ee623ec04e977a216e0e46a7053a70537980ef815.zip" -> "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.zip"
          ~ "timestamp" = "1682458673177037000" -> "1682461250845627000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "445722301409072987" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4313ab299a0768756c36fa6ee623ec04e977a216e0e46a7053a70537980ef815.zip" -> "builds/e603c1f2c6fff96114e0a3ff28349cd47043d81b83526710fba5561b9d59eeef.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 11 to add, 7 to change, 8 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4802727711)*